Revit 2026 API

# ScheduleDefinitionCanFilterByGlobalParameters Method

---

Checks whether a field can be used with a global parameter-based filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFilterByGlobalParameters(
	ScheduleFieldId fieldId
)
```
```vb
Public Function CanFilterByGlobalParameters (
	fieldId As ScheduleFieldId
) As Boolean
```
```cpp
public:
bool CanFilterByGlobalParameters(
	ScheduleFieldId^ fieldId
)
```
```fsharp
member CanFilterByGlobalParameters :
        fieldId : ScheduleFieldId -> bool
```

#### Parameters

fieldId ScheduleFieldId
     The ID of the field to check.

#### Return Value

Boolean True if the field can be used with a global parameter-based filter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.

Only parameters which have a compatible type with at least one existing global parameter can be filtered.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace